spec/fixtures/webhooks/charge.refunded.json

{
  "id": "evt_gmo01lbs952p8qwr3x9985ou",
  "object": "event",
  "api_version": "2014-12-22",
  "created": 1485974099,
  "data": {
    "object": {
      "id": "ch_y4ewvw6xbacdoausdsdnrgfv",
      "object": "charge",
      "amount": 2091,
      "amount_refunded": 2091,
      "application": null,
      "application_fee": null,
      "balance_transaction": "txn_lxskpxxh96w949p5w7hep3w3",
      "captured": true,
      "card": {
        "id": "card_wo0g3lrrze8nn5xams0vlxve",
        "object": "card",
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": null,
        "address_zip_check": null,
        "brand": "MasterCard",
        "country": "US",
        "customer": "cus_pyy6z62oaa9bi1",
        "cvc_check": null,
        "dynamic_last4": null,
        "exp_month": 7,
        "exp_year": 2018,
        "fingerprint": "ZjSZWnwfjeVnFahl",
        "funding": "credit",
        "last4": "1118",
        "metadata": {
        },
        "name": null,
        "tokenization_method": null
      },
      "created": 1483250636,
      "currency": "usd",
      "customer": "cus_pyy6z62oaa9bi1",
      "description": null,
      "destination": null,
      "dispute": null,
      "failure_code": null,
      "failure_message": null,
      "fraud_details": {
      },
      "invoice": "in_4nqomt1i2dlolvuzthuaklnk",
      "livemode": true,
      "metadata": {
      },
      "order": null,
      "outcome": {
        "network_status": "approved_by_network",
        "reason": null,
        "risk_level": "normal",
        "seller_message": "Payment complete.",
        "type": "authorized"
      },
      "paid": true,
      "receipt_email": null,
      "receipt_number": null,
      "refunded": true,
      "refunds": {
        "object": "list",
        "data": [
          {
            "id": "re_20prglq7dqcyjrpwawsv7ir9",
            "object": "refund",
            "amount": 2091,
            "balance_transaction": "txn_zy09ld4cm5upaj6219kcwecj",
            "charge": "ch_y4ewvw6xbacdoausdsdnrgfv",
            "created": 1485974098,
            "currency": "usd",
            "metadata": {
            },
            "reason": null,
            "receipt_number": null,
            "status": "succeeded"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges/ch_y4ewvw6xbacdoausdsdnrgfv/refunds"
      },
      "review": null,
      "shipping": null,
      "source": {
        "id": "card_wo0g3lrrze8nn5xams0vlxve",
        "object": "card",
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": null,
        "address_zip_check": null,
        "brand": "MasterCard",
        "country": "US",
        "customer": "cus_pyy6z62oaa9bi1",
        "cvc_check": null,
        "dynamic_last4": null,
        "exp_month": 7,
        "exp_year": 2018,
        "fingerprint": "ZjSZWnwfjeVnFahl",
        "funding": "credit",
        "last4": "1118",
        "metadata": {
        },
        "name": null,
        "tokenization_method": null
      },
      "source_transfer": null,
      "statement_descriptor": "MRIDERS FAM MEM",
      "status": "paid",
      "transfer_group": null
    },
    "previous_attributes": {
      "amount_refunded": 0,
      "refunded": false,
      "refunds": {
        "object": "list",
        "data": [

        ],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/charges/ch_y4ewvw6xbacdoausdsdnrgfv/refunds"
      }
    }
  },
  "livemode": true,
  "pending_webhooks": 0,
  "request": "req_ilqyi289x001es",
  "type": "charge.refunded"
}
