spec/fixtures/webhooks/customer.subscription.created.json

{
  "id": "evt_wreztfvzth7j1cr08j77lyha",
  "object": "event",
  "api_version": "2014-12-22",
  "created": 1486732550,
  "data": {
    "object": {
      "id": "sub_sa5yarc0cihg2t",
      "object": "subscription",
      "application_fee_percent": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1486732550,
      "current_period_end": 1514782800,
      "current_period_start": 1486732550,
      "customer": "cus_3dh1eabckddgf4",
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_3daiycspt8f4s6m9yf8xze2q",
            "object": "subscription_item",
            "created": 1486732550,
            "plan": {
              "id": "individual",
              "object": "plan",
              "amount": 1061,
              "created": 1421013340,
              "currency": "usd",
              "interval": "year",
              "interval_count": 1,
              "livemode": true,
              "metadata": {
              },
              "name": "Midnight Riders Individual Membership",
              "statement_descriptor": "MRIDERS IND MEM",
              "trial_period_days": null
            },
            "quantity": 1
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_sa5yarc0cihg2t"
      },
      "livemode": true,
      "metadata": {
      },
      "plan": {
        "id": "individual",
        "object": "plan",
        "amount": 1061,
        "created": 1421013340,
        "currency": "usd",
        "interval": "year",
        "interval_count": 1,
        "livemode": true,
        "metadata": {
        },
        "name": "Midnight Riders Individual Membership",
        "statement_descriptor": "MRIDERS IND MEM",
        "trial_period_days": null
      },
      "quantity": 1,
      "start": 1486732550,
      "status": "trialing",
      "tax_percent": null,
      "trial_end": 1514782800,
      "trial_start": 1486732550
    }
  },
  "livemode": true,
  "pending_webhooks": 0,
  "request": "req_2q6sqqe3slxei0",
  "type": "customer.subscription.created"
}
