spec/fixtures/webhooks/customer.subscription.deleted.json

{
  "id": "evt_9vx19hplsuotkvvqlnhs53hs",
  "object": "event",
  "api_version": "2014-12-22",
  "created": 1485969506,
  "data": {
    "object": {
      "id": "sub_zx0rrs8ro4gsun",
      "object": "subscription",
      "application_fee_percent": null,
      "cancel_at_period_end": false,
      "canceled_at": 1485969506,
      "created": 1463358635,
      "current_period_end": 1514782800,
      "current_period_start": 1483246800,
      "customer": "cus_pyy6z62oaa9bi1",
      "discount": null,
      "ended_at": 1485969506,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_w22xiz8vqbhn4kp5noglwdh7",
            "object": "subscription_item",
            "created": 1463358635,
            "plan": {
              "id": "family",
              "object": "plan",
              "amount": 2091,
              "created": 1421013291,
              "currency": "usd",
              "interval": "year",
              "interval_count": 1,
              "livemode": true,
              "metadata": {
              },
              "name": "Midnight Riders Family Membership",
              "statement_descriptor": "MRIDERS FAM MEM",
              "trial_period_days": null
            },
            "quantity": 1
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_zx0rrs8ro4gsun"
      },
      "livemode": true,
      "metadata": {
      },
      "plan": {
        "id": "family",
        "object": "plan",
        "amount": 2091,
        "created": 1421013291,
        "currency": "usd",
        "interval": "year",
        "interval_count": 1,
        "livemode": true,
        "metadata": {
        },
        "name": "Midnight Riders Family Membership",
        "statement_descriptor": "MRIDERS FAM MEM",
        "trial_period_days": null
      },
      "quantity": 1,
      "start": 1463358635,
      "status": "canceled",
      "tax_percent": null,
      "trial_end": 1483246800,
      "trial_start": 1463358635
    }
  },
  "livemode": true,
  "pending_webhooks": 0,
  "request": "req_eejv18cq5fwtuj",
  "type": "customer.subscription.deleted"
}
