spec/fixtures/webhooks/invoice.payment_succeeded.json

{
  "id": "evt_jgf8tslkcpxqph3idvx23qs8",
  "object": "event",
  "api_version": "2014-12-22",
  "created": 1518268550,
  "data": {
    "object": {
      "id": "in_ly6smi2vsa0cy4q0g43jlxhc",
      "object": "invoice",
      "amount_due": 0,
      "application_fee": null,
      "attempt_count": 0,
      "attempted": true,
      "charge": null,
      "closed": true,
      "currency": "usd",
      "customer": "cus_3dh1eabckddgf4",
      "date": 1518268550,
      "description": null,
      "discount": null,
      "ending_balance": 0,
      "forgiven": false,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "sub_sa5yarc0cihg2t",
            "object": "line_item",
            "amount": 0,
            "currency": "usd",
            "description": null,
            "discountable": true,
            "livemode": true,
            "metadata": {
            },
            "period": {
              "start": 1518268550,
              "end": 1546318800
            },
            "plan": {
              "id": "individual",
              "object": "plan",
              "amount": 1061,
              "created": 1421013340,
              "currency": "usd",
              "interval": "year",
              "interval_count": 1,
              "livemode": true,
              "metadata": {
              },
              "name": "Midnight Riders Individual Membership",
              "statement_descriptor": "MRIDERS IND MEM",
              "trial_period_days": null
            },
            "proration": false,
            "quantity": 1,
            "subscription": null,
            "subscription_item": "si_3daiycspt8f4s6m9yf8xze2q",
            "type": "subscription"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_ly6smi2vsa0cy4q0g43jlxhc/lines"
      },
      "livemode": true,
      "metadata": {
      },
      "next_payment_attempt": null,
      "paid": true,
      "period_end": 1518268550,
      "period_start": 1518268550,
      "receipt_number": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "subscription": "sub_sa5yarc0cihg2t",
      "subtotal": 0,
      "tax": null,
      "tax_percent": null,
      "total": 0,
      "webhooks_delivered_at": null,
      "payment": null
    }
  },
  "livemode": true,
  "pending_webhooks": 0,
  "request": "req_2q6sqqe3slxei0",
  "type": "invoice.payment_succeeded"
}
